Revit 2026 API

# BuiltInFailuresFabricAreaFailures Class

---

Failures related to fabric area elements.

SystemObject Autodesk.Revit.DBBuiltInFailuresFabricAreaFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class FabricAreaFailures
```
```vb
Public NotInheritable Class FabricAreaFailures
```
```cpp
public ref class FabricAreaFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FabricAreaFailures = class end
```

The BuiltInFailuresFabricAreaFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FabricAreaLapSplicesIncorrect | Fabric Area lap splice is incorrect. |
|  | FabricAreaOutSideOfHost | Fabric Area is sketched completely outside of its host. |

#### Reference

Autodesk.Revit.DB Namespace